[{"name":"Web_server","description":"Ce projet vous demandera d'écrire votre propre serveur HTTP. Vous devrez suivre la RFC d'HTTP et vous serez donc capable de tester avec un vrai browser web. HTTP est un des protocoles les plus utilisés sur internet. Connaitre son fonctionnement sera plus qu'utile même si vous ne faites pas de web à la fin.","type":"Web","language":"CPP","img_language":"../images/CPP-icon.webp","subjet":"","link":"https://github.com/Misterwayne/Web_server"},{"name":"Philosophers","description":"Manger, Dormir, Spaghetti, répéter. Ce projet vous permettra de comprendre l'utilisation des \"threads\". Parmi un groupe de philosophes, à vous d'anticiper de façon précise le moment où chaque philosophe du groupe devra prendre des fourchettes et manger des spaghettis, sans qu'aucun d'eux ne meurt de faim.","type":"Algorithme","language":"C","img_language":"../images/CPP-icon.webp","subjet":"","link":"https://github.com/Misterwayne/Philosophers"},{"name":"Cub3d","description":"Labyrinthe 3d utilisant le raycasting","type":"Grapique","language":"C","img_language":"../images/C-icon.webp","subjet":"","link":"https://github.com/Misterwayne/cub3D"},{"name":"Inception","description":"Ce projet a pour but d'approfondir vos connaissances en vous faisant utiliser Docker. Vous allez virtualiser plusieurs images Docker en les créant dans votre nouvelle machine virtuelle personnelle.","type":"Devops","language":"Docker","img_language":"../images/Docker-Symbol.webp","subjet":"","link":"https://github.com/Misterwayne/Inception"},{"name":"Transcendance","description":"Grâce à votre site web, les utilisateurs pourront jouer à Pong entre eux. Vous fournirez une interface utilisateur, un chat et des parties en ligne multijoueurs en temps réel !\nVotre travail doit respecter les règles suivantes :\nLe backend de votre site doit être écrit en NestJS.\nQuant au frontend, il sera réalisé avec le framework TypeScript de votre choix.\nVous êtes libre d'utiliser les bibliothèques que vous souhaitez dans ce contexte.\nToutefois, vous avez pour obligation de choisir la dernière version stable de\nchaque bibliothèque ou framework utilisé.\nVous devez utiliser une base de données PostgreSQL. Aucune autre base de données\nn'est autorisée.\nVotre site web doit être une application web monopage. L'utilisateur doit pouvoir\nutiliser les boutons Précédent et Suivant du navigateur.\nVotre site web doit être compatible avec la dernière version stable à jour de\nGoogle Chrome, et un autre navigateur de votre choix.\nL'utilisateur ne doit pas rencontrer d'erreurs non gérées ou d'avertissement survotre site.\nVous devez lancer le tout par un simple appel à : docker-compose up --build","type":"Web","language":"React/JS","img_language":"../images/react-logo.webp","subjet":"","link":"https://github.com/JCluzet/ePong"},{"name":"Minitalk","description":"Un programme de communication sous la forme d'un client et d'un serveur.\nLe serveur doit être lancé en premier et doit, après le lancement, afficher son PID.\nLe client prend deux paramètres :\nLe PID du serveur.\nUne chaîne de caractères à transmettre.\nLe client doit communiquer au serveur la chaîne passée en paramètre.\nUne fois la chaîne entièrement reçue, le serveur doit l'afficher.\nLe serveur doit être capable d'afficher la chaîne rapidement. Par rapidement, on entend que si vous pensez que c'est trop long, alors c'est sûrement trop long.\nVotre serveur doit pouvoir recevoir des chaînes de plusieurs clients à la suite sans nécessiter d'être relancé.\nVous ne pouvez utiliser que les deux signaux suivants : SIGUSR1 et SIGUSR2.","type":"Algorithme","language":"C","img_language":"../images/react-logo.webp","subjet":"","link":"https://github.com/Misterwayne/Minitalk"},{"name":"FT_server","description":"Vous devez rendre tous les fichiers nécessaires a la configuration de votre serveur dans un dossier srcs.\nVotre fichier Dockerfile devra se trouver a la racine de votre repo. Celui-ci uniquement servira à build votre container.\nVous n'avez donc pas le droit à dockercompose.\nTous les fichiers nécessaires à votre wordpress devront être dans les sources","type":"Devops","language":"Docker","img_language":"../images/react-logo.webp","subjet":"","link":"https://github.com/Misterwayne/ft_server"},{"name":"Minishell","description":"Votre shell doit :\nAfficher un prompt en l'attente d'une nouvelle commande.\nPosséder un historique fonctionnel.\nChercher et lancer le bon exécutable (en se basant sur la variable d'environnement PATH, ou sur un chemin relatif ou absolu).\nNe pas utiliser plus d'une variable globale. Réfléchissez-y car vous devrez justifier son utilisation.\nNe pas interpréter de quotes (guillemets) non fermés ou de caractères spéciaux non\ndemandés dans le sujet, tels que \\ (le backslash) ou ; (le point-virgule).\nGérer ` (single quote) qui doit empêcher le shell d'interpréter les méta-caractères\nprésents dans la séquence entre guillemets.\nGérer (double quote) qui doit empêcher le shell d'interpréter les méta-caractères\nprésents dans la séquence entre guillemets sauf le $ (signe dollar).\nMinishell Aussi mignon qu'un vrai shell\nImplémenter les redirections :\n< doit rediriger l'entrée.\n> doit rediriger la sortie.\n<< doit recevoir un délimiteur et lire l'input donné jusqu'à rencontrer une ligne\ncontenant le délimiteur. Cependant, l'historique n'a pas à être mis à jour !\n>> doit rediriger la sortie en mode append.\nImplémenter les pipes (caractère |). La sortie de chaque commande de la pipeline\nest connectée à l'entrée de la commande suivante grâce à un pipe.\nGérer les variables d'environnement (un $ suivi d'une séquence de caractères)\nqui doivent être substituées par leur contenu.\nGérer $? qui doit être substitué par le statut de sortie de la dernière pipeline\nexécutée au premier plan.\nGérer ctrl-C, ctrl-D et ctrl-\\ qui doivent fonctionner comme dans bash.\nEn mode interactif :\nctrl-C affiche un nouveau prompt sur une nouvelle ligne.\nctrl-D quitte le shell.\nctrl-\\ ne fait rien.\nVotre shell doit implémenter les builtins suivantes :\necho et l'option -n\ncd uniquement avec un chemin relatif ou absolu\npwd sans aucune option\nexport sans aucune option\nunset sans aucune option\nenv sans aucune option ni argument\nexit sans aucune option\nLa fonction readline() peut causer des fuites de mémoire. Vous n'avez pas à les\ngérer. Attention, cela ne veut pas pour autant dire que votre code, oui celui que\nvous avez écrit, peut avoir des fuites de mémoire","type":"Algorithme","language":"C","img_language":"../images/CPP-icon.webp","subjet":"","link":"https://github.com/Misterwayne/Web_server"},{"name":"push_swap","description":"Ce projet vous demande de trier des données sur une pile, avec un set d'instructions limité, en moins de coups possibles. Pour le réussir, vous devrez manipuler différents algorithmes de tri et choisir la (ou les ?) solution la plus appropriée pour un classement optimisé des données.","type":"Algorithme","language":"C","link":"https://github.com/Misterwayne/Push_swap"},{"name":"Feather","description":"Blockchain Hackathon project.  Feather is a automatized and decentralized publisher, rewarding writers for there work.  Build a journal for the people, owned by the people.","type":"Web","language":"React/JS","link":"https://github.com/tp0ns/Feather"}]